Additions to terraform readme.md
